user_tutorial/fluidStructOptFoam/fluidStructOpt_180deg/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu                         		  nu [0 2 -1 0 0 0 0]	29.1e-06;	// Viscosity (when nu_temp_dep=0)

// Material densities
rho_fluid				   rho_fluid [1 -3  0 0 0 0 0]	865.0;		// Fluid density
rho_solid           	   rho_solid [1 -3  0 0 0 0 0]  2780.0;		// Solid density

//// Porosity controls
// Flow resistance (rapidly slows fluid velocity as pseudo density transitions to 0 -> solid)
l_char       	  			l_char [0  1  0 0 0 0 0]	0.005;      // Characteristic length
darcy													5.0e-07;    // Darcy number
alpha_scale												5.0e-03;    // Scale factor for early implementation
dalpha		                                			10.0;		// Percent increase rate for flow resistance

// Pressure controls
P_operating												1.4e07;		// Operating pressure of the fluid
P_ref													101325.0;	// Reference pressure
